In [1]:
import pandas as pd
# Our small data set
d = {'one':[1,1,1,1,1,1],
     'two':[2,2,2,2,2,3],
     'letter':['a','a','b','b','c','b']}

# Create dataframe
df = pd.DataFrame(d)
'''df.set_index(['letter','one'],inplace=True)
df.loc[df.index[0]]'''
df

  letter  one  two
0      a    1    2
1      a    1    2
2      b    1    2
3      b    1    2
4      c    1    2
5      b    1    3

In [35]:
one = df.groupby(['letter','one'])['two'].mean()
print(one.count())
print('\n\n',one)
grouped_df = df.groupby(['letter','one'])
grouped_df.count()

3


 letter  one
a       1      2.000000
b       1      2.333333
c       1      2.000000
Name: two, dtype: float64

            two
letter one
a      1      2
b      1      3
c      1      1

In [29]:
grouped_df = df.groupby(['letter','one'])
for key,item in grouped_df:
    print(grouped_df.get_group(key),'\n\n',grouped_df.get_group(key).count(),'\n\n',key,'\n\n',item, "\n\n\n\n")
    #print(grouped_df[key], "\n\n") not works

  letter  one  two
0      a    1    2
1      a    1    2

 letter    2
one       2
two       2
dtype: int64

 ('a', 1)

   letter  one  two
0      a    1    2
1      a    1    2




  letter  one  two
2      b    1    2
3      b    1    2
5      b    1    3

 letter    3
one       3
two       3
dtype: int64

 ('b', 1)

   letter  one  two
2      b    1    2
3      b    1    2
5      b    1    3




  letter  one  two
4      c    1    2

 letter    1
one       1
two       1
dtype: int64

 ('c', 1)

   letter  one  two
4      c    1    2

In [8]:
letterone.index

NameError: name 'letterone' is not defined

In [22]:
type(letterone.index)

pandas.core.indexes.multi.MultiIndex

In [50]:
df1 = pd.DataFrame( { 
    "Name" : ["Alice", "Bob", "Mallory", "Mallory", "Bob" , "Mallory"] , 
    "City" : ["Seattle", "Seattle", "Portland", "Seattle", "Seattle", "Portland"] } )

In [53]:
 df = pd.DataFrame({'AAA' : [4,5,6,7], 'BBB' : [10,20,30,40],'CCC' : [100,50,-30,-50]});

In [55]:
df.mean(axis=1)

0    38.0
1    25.0
2     2.0
3    -1.0
dtype: float64

{'a': 8, 'b': 8, 'c': 8}